load-test/results/express/2000-vus

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: ./scripts/load-test-get.js

    duration: -, iterations: -
         vus: 1, max: 2000

    init [----------------------------------------------------------] starting
    ✓ is status 200

    checks.....................: 100.00% ✓ 112389 ✗ 0     
    data_received..............: 23 MB   390 kB/s
    data_sent..................: 8.8 MB  147 kB/s
    http_req_blocked...........: avg=20.94µs min=4.4µs   max=5.32ms   p(90)=13.3µs  p(95)=20.4µs   p(99)=432.71µs
    http_req_connecting........: avg=10.88µs min=0s      max=5.22ms   p(90)=0s      p(95)=0s       p(99)=375.6µs 
  ✗ http_req_duration..........: avg=30.21ms min=988.9µs max=332.17ms p(90)=86.06ms p(95)=109.58ms p(99)=240.86ms
    http_req_receiving.........: avg=52.87µs min=17.8µs  max=3.39ms   p(90)=74.3µs  p(95)=86µs     p(99)=124.5µs 
    http_req_sending...........: avg=18.84µs min=6.7µs   max=2.83ms   p(90)=27.8µs  p(95)=36.2µs   p(99)=66.4µs  
    http_req_tls_handshaking...: avg=0s      min=0s      max=0s       p(90)=0s      p(95)=0s       p(99)=0s      
    http_req_waiting...........: avg=30.14ms min=932.7µs max=332.1ms  p(90)=85.98ms p(95)=109.47ms p(99)=240.78ms
    http_reqs..................: 112389  1873.129583/s
    iteration_duration.........: avg=1.03s   min=1s      max=1.33s    p(90)=1.08s   p(95)=1.11s    p(99)=1.24s   
    iterations.................: 110435  1840.563271/s
    vus........................: 2000    min=395  max=2000
    vus_max....................: 2000    min=2000 max=2000